app/controllers/api/shops_controller.rb

  def show
    @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def index
    @shops = Shop.all
---
SELECT "shops".* FROM "shops"