app/controllers/api/users_controller.rb

  def index
    @users = User.all[1..-1]
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
      login(@user)
      @cart = Cart.create(user_id: @user.id)
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"